; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=399, out_folder=./training, instance_id=93, seed=2117, goal_proportion=0.03

(define (problem blocksworld-93)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 b388 b389 b390 b391 b392 b393 b394 b395 b396 b397 b398 b399 - object)
 (:init 
    (arm-empty)
    (clear b62)
    (on b62 b297)
    (on b297 b188)
    (on b188 b322)
    (on-table b322)
    (clear b246)
    (on b246 b213)
    (on b213 b230)
    (on b230 b93)
    (on b93 b75)
    (on b75 b341)
    (on b341 b162)
    (on-table b162)
    (clear b291)
    (on b291 b278)
    (on b278 b187)
    (on b187 b127)
    (on-table b127)
    (clear b70)
    (on b70 b212)
    (on-table b212)
    (clear b119)
    (on b119 b304)
    (on b304 b167)
    (on b167 b366)
    (on b366 b20)
    (on b20 b175)
    (on b175 b202)
    (on b202 b359)
    (on b359 b192)
    (on b192 b48)
    (on b48 b181)
    (on-table b181)
    (clear b186)
    (on-table b186)
    (clear b19)
    (on b19 b397)
    (on-table b397)
    (clear b161)
    (on b161 b26)
    (on b26 b194)
    (on b194 b279)
    (on b279 b148)
    (on b148 b395)
    (on b395 b80)
    (on b80 b71)
    (on b71 b373)
    (on b373 b211)
    (on b211 b183)
    (on b183 b369)
    (on b369 b337)
    (on-table b337)
    (clear b320)
    (on b320 b25)
    (on b25 b42)
    (on-table b42)
    (clear b157)
    (on b157 b287)
    (on b287 b289)
    (on-table b289)
    (clear b128)
    (on b128 b67)
    (on-table b67)
    (clear b372)
    (on b372 b74)
    (on b74 b354)
    (on-table b354)
    (clear b282)
    (on b282 b57)
    (on b57 b351)
    (on b351 b334)
    (on b334 b97)
    (on b97 b88)
    (on b88 b151)
    (on b151 b301)
    (on b301 b1)
    (on b1 b130)
    (on b130 b336)
    (on-table b336)
    (clear b308)
    (on b308 b377)
    (on b377 b286)
    (on-table b286)
    (clear b203)
    (on-table b203)
    (clear b280)
    (on b280 b338)
    (on b338 b166)
    (on b166 b356)
    (on b356 b138)
    (on b138 b254)
    (on b254 b14)
    (on b14 b116)
    (on-table b116)
    (clear b158)
    (on b158 b36)
    (on-table b36)
    (clear b335)
    (on-table b335)
    (clear b296)
    (on b296 b385)
    (on b385 b250)
    (on b250 b257)
    (on-table b257)
    (clear b171)
    (on b171 b259)
    (on-table b259)
    (clear b173)
    (on b173 b374)
    (on-table b374)
    (clear b340)
    (on b340 b185)
    (on-table b185)
    (clear b311)
    (on b311 b239)
    (on b239 b126)
    (on-table b126)
    (clear b353)
    (on-table b353)
    (clear b33)
    (on-table b33)
    (clear b174)
    (on b174 b285)
    (on b285 b277)
    (on b277 b324)
    (on-table b324)
    (clear b199)
    (on b199 b315)
    (on b315 b146)
    (on-table b146)
    (clear b9)
    (on b9 b225)
    (on b225 b248)
    (on-table b248)
    (clear b23)
    (on-table b23)
    (clear b58)
    (on b58 b384)
    (on-table b384)
    (clear b312)
    (on b312 b261)
    (on-table b261)
    (clear b10)
    (on b10 b237)
    (on-table b237)
    (clear b34)
    (on b34 b238)
    (on b238 b275)
    (on b275 b141)
    (on b141 b45)
    (on-table b45)
    (clear b117)
    (on b117 b182)
    (on b182 b347)
    (on b347 b398)
    (on-table b398)
    (clear b180)
    (on-table b180)
    (clear b125)
    (on b125 b197)
    (on b197 b390)
    (on b390 b228)
    (on b228 b368)
    (on b368 b131)
    (on-table b131)
    (clear b101)
    (on b101 b176)
    (on b176 b196)
    (on-table b196)
    (clear b142)
    (on b142 b283)
    (on b283 b363)
    (on b363 b2)
    (on-table b2)
    (clear b263)
    (on b263 b392)
    (on b392 b348)
    (on-table b348)
    (clear b269)
    (on b269 b247)
    (on b247 b219)
    (on-table b219)
    (clear b155)
    (on b155 b159)
    (on b159 b102)
    (on b102 b387)
    (on b387 b244)
    (on-table b244)
    (clear b92)
    (on b92 b284)
    (on b284 b235)
    (on b235 b272)
    (on-table b272)
    (clear b39)
    (on-table b39)
    (clear b270)
    (on b270 b264)
    (on b264 b112)
    (on-table b112)
    (clear b224)
    (on b224 b84)
    (on b84 b24)
    (on b24 b361)
    (on b361 b367)
    (on b367 b90)
    (on-table b90)
    (clear b28)
    (on-table b28)
    (clear b193)
    (on b193 b8)
    (on b8 b323)
    (on b323 b318)
    (on b318 b49)
    (on b49 b355)
    (on-table b355)
    (clear b207)
    (on b207 b164)
    (on-table b164)
    (clear b172)
    (on b172 b54)
    (on b54 b293)
    (on b293 b345)
    (on b345 b59)
    (on b59 b60)
    (on b60 b330)
    (on b330 b177)
    (on b177 b362)
    (on b362 b256)
    (on b256 b143)
    (on-table b143)
    (clear b349)
    (on b349 b298)
    (on b298 b273)
    (on b273 b271)
    (on-table b271)
    (clear b105)
    (on b105 b31)
    (on b31 b56)
    (on b56 b231)
    (on b231 b149)
    (on b149 b124)
    (on b124 b137)
    (on b137 b108)
    (on-table b108)
    (clear b236)
    (on b236 b104)
    (on b104 b357)
    (on b357 b98)
    (on b98 b266)
    (on b266 b96)
    (on-table b96)
    (clear b50)
    (on b50 b305)
    (on b305 b145)
    (on b145 b40)
    (on b40 b46)
    (on b46 b91)
    (on b91 b306)
    (on b306 b133)
    (on b133 b267)
    (on-table b267)
    (clear b47)
    (on b47 b352)
    (on b352 b150)
    (on b150 b7)
    (on b7 b77)
    (on b77 b3)
    (on b3 b121)
    (on b121 b309)
    (on b309 b16)
    (on b16 b234)
    (on b234 b55)
    (on b55 b380)
    (on b380 b329)
    (on b329 b396)
    (on b396 b208)
    (on b208 b303)
    (on b303 b132)
    (on-table b132)
    (clear b15)
    (on-table b15)
    (clear b386)
    (on b386 b299)
    (on-table b299)
    (clear b375)
    (on b375 b358)
    (on-table b358)
    (clear b178)
    (on b178 b376)
    (on b376 b319)
    (on b319 b370)
    (on b370 b252)
    (on-table b252)
    (clear b233)
    (on b233 b165)
    (on-table b165)
    (clear b343)
    (on b343 b11)
    (on b11 b22)
    (on-table b22)
    (clear b4)
    (on-table b4)
    (clear b109)
    (on-table b109)
    (clear b242)
    (on b242 b73)
    (on b73 b65)
    (on b65 b156)
    (on-table b156)
    (clear b12)
    (on b12 b21)
    (on-table b21)
    (clear b383)
    (on-table b383)
    (clear b399)
    (on b399 b107)
    (on b107 b205)
    (on-table b205)
    (clear b152)
    (on b152 b114)
    (on b114 b154)
    (on-table b154)
    (clear b87)
    (on b87 b30)
    (on b30 b17)
    (on b17 b113)
    (on b113 b310)
    (on b310 b120)
    (on b120 b189)
    (on b189 b198)
    (on b198 b302)
    (on-table b302)
    (clear b217)
    (on b217 b325)
    (on b325 b288)
    (on b288 b103)
    (on b103 b94)
    (on b94 b226)
    (on-table b226)
    (clear b195)
    (on-table b195)
    (clear b95)
    (on b95 b243)
    (on b243 b210)
    (on b210 b326)
    (on-table b326)
    (clear b371)
    (on-table b371)
    (clear b170)
    (on b170 b274)
    (on b274 b123)
    (on-table b123)
    (clear b190)
    (on b190 b206)
    (on b206 b13)
    (on b13 b168)
    (on b168 b281)
    (on b281 b44)
    (on b44 b394)
    (on b394 b314)
    (on-table b314)
    (clear b333)
    (on b333 b139)
    (on b139 b249)
    (on b249 b18)
    (on b18 b38)
    (on b38 b43)
    (on-table b43)
    (clear b344)
    (on b344 b136)
    (on-table b136)
    (clear b258)
    (on b258 b191)
    (on-table b191)
    (clear b129)
    (on b129 b214)
    (on-table b214)
    (clear b5)
    (on b5 b64)
    (on b64 b241)
    (on b241 b169)
    (on b169 b350)
    (on b350 b328)
    (on b328 b82)
    (on b82 b218)
    (on-table b218)
    (clear b391)
    (on b391 b317)
    (on b317 b68)
    (on b68 b89)
    (on b89 b232)
    (on b232 b32)
    (on b32 b66)
    (on-table b66)
    (clear b100)
    (on b100 b86)
    (on b86 b268)
    (on b268 b201)
    (on b201 b364)
    (on-table b364)
    (clear b29)
    (on b29 b200)
    (on-table b200)
    (clear b220)
    (on-table b220)
    (clear b53)
    (on b53 b321)
    (on b321 b388)
    (on b388 b294)
    (on-table b294)
    (clear b147)
    (on-table b147)
    (clear b118)
    (on b118 b240)
    (on b240 b35)
    (on b35 b316)
    (on b316 b179)
    (on b179 b255)
    (on b255 b227)
    (on b227 b83)
    (on b83 b221)
    (on b221 b134)
    (on b134 b160)
    (on b160 b313)
    (on-table b313)
    (clear b331)
    (on-table b331)
    (clear b163)
    (on b163 b106)
    (on-table b106)
    (clear b346)
    (on b346 b251)
    (on-table b251)
    (clear b69)
    (on-table b69)
    (clear b140)
    (on-table b140)
    (clear b381)
    (on b381 b81)
    (on b81 b378)
    (on-table b378)
    (clear b389)
    (on b389 b292)
    (on b292 b51)
    (on b51 b61)
    (on b61 b72)
    (on b72 b41)
    (on b41 b290)
    (on-table b290)
    (clear b262)
    (on b262 b307)
    (on b307 b63)
    (on b63 b6)
    (on-table b6)
    (clear b135)
    (on b135 b37)
    (on b37 b110)
    (on b110 b222)
    (on b222 b276)
    (on b276 b79)
    (on b79 b379)
    (on b379 b260)
    (on b260 b111)
    (on b111 b300)
    (on b300 b365)
    (on-table b365)
    (clear b253)
    (on b253 b122)
    (on b122 b339)
    (on b339 b115)
    (on-table b115)
    (clear b223)
    (on b223 b360)
    (on b360 b209)
    (on-table b209)
    (clear b204)
    (on b204 b27)
    (on b27 b382)
    (on b382 b327)
    (on b327 b52)
    (on-table b52)
    (clear b393)
    (on b393 b153)
    (on b153 b332)
    (on b332 b295)
    (on b295 b215)
    (on-table b215)
    (clear b265)
    (on b265 b342)
    (on b342 b144)
    (on-table b144)
    (clear b85)
    (on-table b85)
    (clear b216)
    (on-table b216)
    (clear b78)
    (on b78 b184)
    (on b184 b76)
    (on b76 b229)
    (on b229 b245)
    (on b245 b99)
    (on-table b99))
 (:goal  (and 
    (clear b3)
    (on b3 b11)
    (on b11 b7)
    (on b7 b6)
    (on-table b6)
    (clear b9)
    (on b9 b8)
    (on b8 b4)
    (on b4 b2)
    (on b2 b1)
    (on b1 b10)
    (on b10 b5)
    (on-table b5))))

; plan
1. (unstack b5 b64)
   deleted: (on b5 b64) (clear b5) (arm-empty)
   added: (holding b5) (clear b64)
   goals met: 2 of 13
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 13
3. (unstack b142 b283)
   deleted: (on b142 b283) (clear b142) (arm-empty)
   added: (holding b142) (clear b283)
   goals met: 3 of 13
4. (putdown b142)
   deleted: (holding b142)
   added: (clear b142) (arm-empty) (on-table b142)
   goals met: 3 of 13
5. (unstack b193 b8)
   deleted: (on b193 b8) (clear b193) (arm-empty)
   added: (holding b193) (clear b8)
   goals met: 3 of 13
6. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 3 of 13
7. (unstack b262 b307)
   deleted: (on b262 b307) (clear b262) (arm-empty)
   added: (holding b262) (clear b307)
   goals met: 3 of 13
8. (putdown b262)
   deleted: (holding b262)
   added: (clear b262) (arm-empty) (on-table b262)
   goals met: 3 of 13
9. (unstack b282 b57)
   deleted: (on b282 b57) (clear b282) (arm-empty)
   added: (holding b282) (clear b57)
   goals met: 3 of 13
10. (putdown b282)
   deleted: (holding b282)
   added: (clear b282) (arm-empty) (on-table b282)
   goals met: 3 of 13
11. (unstack b283 b363)
   deleted: (on b283 b363) (clear b283) (arm-empty)
   added: (holding b283) (clear b363)
   goals met: 3 of 13
12. (putdown b283)
   deleted: (holding b283)
   added: (clear b283) (arm-empty) (on-table b283)
   goals met: 3 of 13
13. (unstack b307 b63)
   deleted: (on b307 b63) (clear b307) (arm-empty)
   added: (holding b307) (clear b63)
   goals met: 3 of 13
14. (putdown b307)
   deleted: (holding b307)
   added: (clear b307) (arm-empty) (on-table b307)
   goals met: 3 of 13
15. (unstack b343 b11)
   deleted: (on b343 b11) (clear b343) (arm-empty)
   added: (holding b343) (clear b11)
   goals met: 3 of 13
16. (putdown b343)
   deleted: (holding b343)
   added: (clear b343) (arm-empty) (on-table b343)
   goals met: 3 of 13
17. (unstack b363 b2)
   deleted: (on b363 b2) (clear b363) (arm-empty)
   added: (holding b363) (clear b2)
   goals met: 3 of 13
18. (putdown b363)
   deleted: (holding b363)
   added: (clear b363) (arm-empty) (on-table b363)
   goals met: 3 of 13
19. (unstack b47 b352)
   deleted: (on b47 b352) (clear b47) (arm-empty)
   added: (holding b47) (clear b352)
   goals met: 3 of 13
20. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 3 of 13
21. (unstack b352 b150)
   deleted: (on b352 b150) (clear b352) (arm-empty)
   added: (holding b352) (clear b150)
   goals met: 3 of 13
22. (putdown b352)
   deleted: (holding b352)
   added: (clear b352) (arm-empty) (on-table b352)
   goals met: 3 of 13
23. (unstack b150 b7)
   deleted: (on b150 b7) (clear b150) (arm-empty)
   added: (holding b150) (clear b7)
   goals met: 3 of 13
24. (putdown b150)
   deleted: (holding b150)
   added: (clear b150) (arm-empty) (on-table b150)
   goals met: 3 of 13
25. (unstack b57 b351)
   deleted: (on b57 b351) (clear b57) (arm-empty)
   added: (holding b57) (clear b351)
   goals met: 3 of 13
26. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 3 of 13
27. (unstack b351 b334)
   deleted: (on b351 b334) (clear b351) (arm-empty)
   added: (holding b351) (clear b334)
   goals met: 3 of 13
28. (putdown b351)
   deleted: (holding b351)
   added: (clear b351) (arm-empty) (on-table b351)
   goals met: 3 of 13
29. (unstack b334 b97)
   deleted: (on b334 b97) (clear b334) (arm-empty)
   added: (holding b334) (clear b97)
   goals met: 3 of 13
30. (putdown b334)
   deleted: (holding b334)
   added: (clear b334) (arm-empty) (on-table b334)
   goals met: 3 of 13
31. (unstack b63 b6)
   deleted: (on b63 b6) (clear b63) (arm-empty)
   added: (holding b63) (clear b6)
   goals met: 3 of 13
32. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 3 of 13
33. (unstack b97 b88)
   deleted: (on b97 b88) (clear b97) (arm-empty)
   added: (holding b97) (clear b88)
   goals met: 3 of 13
34. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 3 of 13
35. (unstack b88 b151)
   deleted: (on b88 b151) (clear b88) (arm-empty)
   added: (holding b88) (clear b151)
   goals met: 3 of 13
36. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 3 of 13
37. (unstack b151 b301)
   deleted: (on b151 b301) (clear b151) (arm-empty)
   added: (holding b151) (clear b301)
   goals met: 3 of 13
38. (putdown b151)
   deleted: (holding b151)
   added: (clear b151) (arm-empty) (on-table b151)
   goals met: 3 of 13
39. (unstack b301 b1)
   deleted: (on b301 b1) (clear b301) (arm-empty)
   added: (holding b301) (clear b1)
   goals met: 3 of 13
40. (putdown b301)
   deleted: (holding b301)
   added: (clear b301) (arm-empty) (on-table b301)
   goals met: 3 of 13
41. (unstack b7 b77)
   deleted: (on b7 b77) (clear b7) (arm-empty)
   added: (holding b7) (clear b77)
   goals met: 3 of 13
42. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 4 of 13
43. (unstack b77 b3)
   deleted: (on b77 b3) (clear b77) (arm-empty)
   added: (holding b77) (clear b3)
   goals met: 5 of 13
44. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 5 of 13
45. (unstack b1 b130)
   deleted: (on b1 b130) (clear b1) (arm-empty)
   added: (holding b1) (clear b130)
   goals met: 5 of 13
46. (stack b1 b10)
   deleted: (clear b10) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b10)
   goals met: 6 of 13
47. (unstack b11 b22)
   deleted: (on b11 b22) (clear b11) (arm-empty)
   added: (holding b11) (clear b22)
   goals met: 6 of 13
48. (stack b11 b7)
   deleted: (clear b7) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b7)
   goals met: 7 of 13
49. (unstack b1 b10)
   deleted: (on b1 b10) (clear b1) (arm-empty)
   added: (holding b1) (clear b10)
   goals met: 6 of 13
50. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 6 of 13
51. (unstack b10 b237)
   deleted: (on b10 b237) (clear b10) (arm-empty)
   added: (holding b10) (clear b237)
   goals met: 6 of 13
52. (stack b10 b5)
   deleted: (clear b5) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b5)
   goals met: 7 of 13
53. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 13
54. (stack b1 b10)
   deleted: (clear b10) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b10)
   goals met: 8 of 13
55. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 8 of 13
56. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 9 of 13
57. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 9 of 13
58. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 10 of 13
59. (unstack b8 b323)
   deleted: (on b8 b323) (clear b8) (arm-empty)
   added: (holding b8) (clear b323)
   goals met: 10 of 13
60. (stack b8 b4)
   deleted: (clear b4) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b4)
   goals met: 11 of 13
61. (unstack b3 b121)
   deleted: (on b3 b121) (clear b3) (arm-empty)
   added: (holding b3) (clear b121)
   goals met: 10 of 13
62. (stack b3 b11)
   deleted: (clear b11) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b11)
   goals met: 12 of 13
63. (unstack b9 b225)
   deleted: (on b9 b225) (clear b9) (arm-empty)
   added: (holding b9) (clear b225)
   goals met: 11 of 13
64. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 13 of 13
